n = 13

for i in range(1, 13):
    # n - 1
    # Пишем 1, за да започнем от 1, иначе започваме от 0
    # Цикъла спира до n - 1. Тоест ако искам 12, трябва да сложа 13.
    # Имаме три параметъра.
    # Ние виждаме един, но те са три. По дифолт, старт е нула -- > (0, 13)
    # Променливата i взима стойност от тази range
    # Range - цифрова колекция, списък
  print(i)

n = 13

for i in range(1, n): # долна граница - 1, по дифолт е 0
    # 1, 2, 3, 4, 5 ... 12
    if i == 5:
        # Ако i = 5, принтирай i.
        # Малко if else пиниз- търси в цикъла и като стигне до 5, принтира
     print(i)

n = 12

for i in range(n, 0, - 3): # 12, 11, 10, 9 ... 1,
    # 0 - невидима нула - затова по средата слагаме 0
    # Започваме от n, а не както е при нормалната, където стигаме до n - 1
    print(i)

text = "Hello SoftUni!"
length = len(text) # Всеки един от символите се счита за част от тази дължина, от този length

# char = text[0]
# Пак започваме от 0 - H e 0
# char = text[0:7]
# Ако дам само 7, ще ми покаже 7 - S
# Ако съм сложил 0:7, 7 няма да ми го изкара
char = text[6:] # от 6 нататък
print(char)